Revit 2022 API
AnalyticalModel Methods
The AnalyticalModel type exposes the following members.
Methods
Name | Description
Approximate
 Switches between non-approximated (e.g., Curved) Analytical Models and approximated (made up of lines only) Analytical Models
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanApproximate
 Indicates if Analytical Model can be approximated or not.
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanDeleteSubelement
 Checks if given subelement can be removed from the element.
 (Inherited from Element.)
CanDisableAutoDetect
 Indicates if Analytical Auto-detect can be disabled programmatically
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveRigidLinks
 Indicates if Analytical Model supports Rigid Links.
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
CanUseHardPoints
 Indicates if Analytical Model can use Hard Points.
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
CloneAdjustment
 The method clones the adjustment of one end of the AM on another AM, with respect to the one of the ends. One of the Analytical Model ends
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
DeleteSubelement
 Removes a subelement from the element.
 (Inherited from Element.)
DeleteSubelements
 Removes the subelements from the element.
 (Inherited from Element.)
Disconnect
 Unjoin from Hub Element.
Dispose |  (Inherited from Element.)
Enable
 Enables or disables Analytical Model, if the Element allows a one-operation Analytical Model toggle.
EnableAutoDetect
 Enable or disable Analytical Auto-detect.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetAnalyticalModelSketchComponents
 Retrieves a collection of AnalyticalModelSketchComponent objects, which are useful for those Analytical Models that have finer calibration below the Element level.
GetAnalyticalModelSupports
 Retrieves the AnalyticalModelSupport array, which is useful to extract Analytical Support Information from Elements.
GetAnalyzeAs
 Returns value of Analyze As parameter for Analytical Model.
GetApproximationDeviation
 Retrieves amount by which approximation is made.
GetAutoDetectMatchedElements
 Retrieves other Element Ids that this Element is Auto-detecting against.
GetCurve
 Returns the single curve of the Analytical Model, if it is only one curve.
GetCurves
 Retrieves all curves for the Analytical Model of a given type.
GetDependentElements
 Get all elements that, from a logical point of view, are the children of this Element.
 (Inherited from Element.)
GetElementId
 Retrieves Element Id of the structural element corresponding to the Analytical Model.
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLocalCoordinateSystem
 Gets the local coordinate system (LCS) for an analytical model element.
GetManualAdjustmentMatchedElements
 Retrieves other Element Ids against which the Analytical Model has been adjusted.
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOffset
 Gets the offset of the analytical model at end.
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameter
Retrieves a parameter from the element given identifier.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPoint
 Retrieves point of the Analytical Model.
GetReference
 Returns a reference to a given curve within the analytical model.
GetRigidLink
 Returns rigid link curve corresponding to selector.
GetSubelements
 Returns the collection of element subelements.
 (Inherited from Element.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasDeletedLinks
 Indicates if Analytical Model contains deleted Analytical Links.
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasRigidLinksWith
 Indicates if Analytical Model has Rigid Links with specified element.
IsAnalyzeAsValid
 Determines if the given Analyze As parameter is valid for this Element.
IsApproximated
 Indicates if Analytical Model is approximated or not.
IsAutoDetectEnabled
 Reports if Analytical Auto-detect for the given direction is enabled.
IsCreatedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsDemolishedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsElementFullySupported
 Indicates if Analytical Model is fully supported.
IsEnabled
 Reports whether the Analytical Model is enabled or disabled.
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsManuallyAdjusted
 Indicates if the Analytical Model has been manually adjusted by the user.
IsModified
 Checks if AM has been adjusted from auto-detect at any end.
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsSingleCurve
 Indicates if the Analytical Model can be expressed as a single curve.
IsSinglePoint
 Indicates if the Analytical Model can be expressed as a single point.
IsValidDirectionForAutoDetect
 Tests if the supplied direction is valid for Analytical Auto-detect.
IsValidForManualAdjustment
 Indicates if the identified reference is acceptable for Manual Analytical Adjustment.
IsValidManualAdjustmentSource
 Indicates if the identified reference is acceptable as a source for Manual Analytical Adjustment.
IsValidManualAdjustmentTarget
 Indicates if reference is acceptable as a "Target" for Manual Analytical Adjustment.
IsValidRigidLinksOption
 Indicates if Rigid Links option is valid for the Analytical Model.
IsValidSelector
 Indicates if the input selector is valid for the Analytical Model.
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
ManuallyAdjust
 Perform Manual Analytical Adjustment on analytical model, with respect to another Element
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
ResetLinks
 The function is trying to recreate analytical link elements that were deleted by the user.
ResetManualAdjustment
 Resets all manual adjustments performed by the user onto the Analytical Model.
SetAnalyzeAs
 Sets value of Analyze As parameter for this Element.
SetApproximationDeviation
 Adjusts the amount by which approximation is made.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetOffset
 Sets the offset of the analytical model at end.
SetUsesHardPoints
 Sets Hard Points for the Analytical Model.
SupportsManualAdjustment
 Indicates if the Element supports Manual Analytical Adjustment.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UsesHardPoints
 Indicates if the Analytical Model is using Hard Points during approximation.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace